# yolov8-dp.yaml
backbone:
  - [-1, 1, Conv, [64, 3, 2]]  
  - [-1, 1, Conv, [128, 3, 2]] 
  - [-1, 3, C2f, [128, True]]  
  - [-1, 1, Conv, [256, 3, 2]] 
  - [-1, 6, C2f, [256, True]]  
  - [-1, 1, Conv, [512, 3, 2]] 
  - [cite_start][-1, 6, C2f_DualSK, [512]]  # Áp dụng LSSK tại Floor 6 để tăng P [cite: 314, 368]
  - [-1, 1, Conv, [1024, 3, 2]] 
  - [cite_start][-1, 3, C2f_DualSK, [1024]] # Áp dụng LSSK tại Floor 8 [cite: 368]
  - [-1, 1, SPPF, [1024, 5]]   

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  
  - [cite_start][-1, 3, C2f_DualSK, [512]]  # Head P4 [cite: 311]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  
  - [cite_start][-1, 3, C2f_DualSK, [256]]  # Head P3 (Quan trọng cho vật thể nhỏ) [cite: 311]

  # Dùng GhostConv ở phần còn lại để nén GFLOPs [cite: 315]
  - [-1, 1, GhostConv, [256, 3, 2]] 
  - [[-1, 12], 1, Concat, [1]] 
  - [-1, 3, C2f, [512]]  

  - [-1, 1, GhostConv, [512, 3, 2]] 
  - [[-1, 9], 1, Concat, [1]]  
  - [-1, 3, C2f, [1024]]  

  - [[15, 18, 21], 1, Detect, [nc]]
